---
kind: enumMember
id: F:Autodesk.Revit.DB.MeshFromGeometryOperationIssue.MissingCurveLoopsInInput
enum: Autodesk.Revit.DB.MeshFromGeometryOperationIssue
source: html/6c89d542-b05c-bbbf-eb8d-e291d71865d0.htm
---
# Autodesk.Revit.DB.MeshFromGeometryOperationIssue.MissingCurveLoopsInInput

While several curve loops were expected as one of the input
 parameters while building a mesh, some of them were not provided.